In [1]:
# list of high schools
high_schools = ["Hernandez High School", "Figueroa High School",
                "Wilson High School","Wright High School"]

In [4]:
for school in high_schools:
    print(school)

Hernandez High School
Figueroa High School
Wilson High School
Wright High School

In [6]:
# A dictionary of high schools and the type of school.
high_school_types = [{"High School": "Griffin", "Type":"District"},
                    {"High School": "Figueroa", "Type": "District"},
                    {"High School": "Wilson", "Type": "Charter"},
                    {"High School": "Wright", "Type": "Charter"}]

In [13]:
for school, type in high_school_types.items():
    print(school,type)

AttributeError: 'list' object has no attribute 'items'

In [15]:
# List of high schools
high_schools = ["Huang High School", "Figueroa High School", "Shelton High School",
                "Hernandez High School","Griffin High School","Wilson High School", 
                "Cabrera High School", "Bailey High School", "Holden High School", 
                "Pena High School", "Wright High School","Rodriguez High School",
                "Johnson High School", "Ford High School", "Thomas High School"]

In [17]:
# adding dependencies
import pandas as pd

In [18]:
# Create a Pandas Series from a list.
school_series = pd.Series(high_schools)
school_series

0         Huang High School
1      Figueroa High School
2       Shelton High School
3     Hernandez High School
4       Griffin High School
5        Wilson High School
6       Cabrera High School
7        Bailey High School
8        Holden High School
9          Pena High School
10       Wright High School
11    Rodriguez High School
12      Johnson High School
13         Ford High School
14       Thomas High School
dtype: object

In [21]:
#iterate through series and print the school name
school_series[12]

'Johnson High School'

In [22]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [23]:
school_df=pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [24]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [25]:
# Initialize an empty data frame
schools_df=pd.DataFrame()

In [27]:
# add the list to a new Dataframe
schools_df["School ID"]=school_id
schools_df["School Name"]=school_name
schools_df["Type"]=type_of_school
# print dataframe
schools_df

   School ID            School Name      Type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [29]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}
schools_new_df=pd.DataFrame(high_schools_dict)
schools_new_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [30]:
# accessing the columns
schools_df.columns

Index(['School ID', 'School Name', 'Type'], dtype='object')

In [31]:
# accessing index
schools_df.index

RangeIndex(start=0, stop=5, step=1)

In [34]:
# accessing values
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [3]:
# Completely different code assessment
import pandas as pd
import numpy as np

apple_df = pd.DataFrame({"AAPL": [72.27, np.nan, 74.39, np.nan, 75.94, 76.93,np.nan, 78.74, np.nan, 79.81, np.nan, 79.53, np.nan, 79.56, 79.49]})

apple_df.isnull().sum()

AAPL    6
dtype: int64

In [9]:
# aanother seperate code
import pandas as pd
import numpy as np
daily_returns = pd.DataFrame({
    "AAPL": [0.5, np.nan, 0.62],
    "GOOG": [0.45, 0.63, 0.55]
})
daily_returns

   AAPL  GOOG
0  0.50  0.45
1   NaN  0.63
2  0.62  0.55

In [12]:
daily_returns.dropna(how="any")

      AAPL  GOOG
0      0.5  0.45
1  unknown  0.63
2     0.62  0.55

In [13]:
# Replace the NaNs with "Unknown"
daily_returns= daily_returns.fillna("unknown")
daily_returns

      AAPL  GOOG
0      0.5  0.45
1  unknown  0.63
2     0.62  0.55

In [16]:
# new assignement
import pandas as pd
import os
# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1, 0.75, 0.47]})
# select the first row using i loc
aapl_returns.iloc[4:7]

   AAPL
4  0.10
5  0.75
6  0.47

In [21]:
import numpy as np
import pandas as pd
revenue_df = pd.DataFrame(
    np.random.randint(low=1, high=1000, size=1000),
    index=pd.date_range('1/1/2017', periods=1000),
    columns=["revenue"])
revenue_df.tail()

            revenue
2019-09-23      423
2019-09-24       51
2019-09-25       12
2019-09-26      315
2019-09-27      587

In [22]:
# Select the last quarter of 2018 to the first quarter of 2019
revenue_df.loc['2018-10-01':'2019-03-31']

            revenue
2018-10-01      131
2018-10-02      696
2018-10-03       72
2018-10-04      279
2018-10-05      596
...             ...
2019-03-27      983
2019-03-28      312
2019-03-29      761
2019-03-30      988
2019-03-31      111

[182 rows x 1 columns]

In [23]:
revenue_df.loc['2018-10-01':'2019-03-31'].describe()

          revenue
count  182.000000
mean   488.532967
std    281.124098
min     16.000000
25%    242.500000
50%    476.500000
75%    723.000000
max    992.000000

In [24]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.head()

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
2   potatoes        10        50.01
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [25]:
sales_df["quantity"]>10

0     True
1     True
2    False
3     True
4    False
Name: quantity, dtype: bool

In [28]:
#filter=sales_df["quantity"]>10
#sales_df.loc[filter]
sales_df.loc[sales_df["quantity"]>10]

       item  quantity  total_price
0  tomatoes        15        50.25
1    onions        26        39.52
3  tomatoes        12        40.20

In [30]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})

sales_df.loc[(sales_df["quantity"]>10) | (sales_df["total_price"]<45)]

        item  quantity  total_price
0   tomatoes        15        50.25
1     onions        26        39.52
3   tomatoes        12        40.20
4  mushrooms         2         8.46

In [33]:
min_price = sales_df["total_price"].max() 
min_price_row = sales_df.loc[sales_df["total_price"] == min_price]
min_price_row

       item  quantity  total_price
0  tomatoes        15        50.25

In [35]:
# for choosing the mean of tomatoes
sales_df.loc[sales_df["item"]=="tomatoes",["total_price"]].mean()

total_price    45.225
dtype: float64

In [39]:
# selecting commas
sales_df.iloc[0:3, [0,2]]

       item  total_price
0  tomatoes        50.25
1    onions        39.52
2  potatoes        50.01

In [3]:
import pandas as pd
import os
# Module 6 test data used for Group by function
sales_df = pd.DataFrame({
    "item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms", "potatoes", "onions", "tomatoes", "onions", "tomatoes"],
    "store": ["Downtown", "Downtown", "Midtown", "Midtown", "Downtown", "Midtown", "Downtown", "Midtown", "Midtown", "Midtown"],
    "quantity": [15, 26, 10, 12, 2, 3, 17, 16, 20, 9],
    "total_price": [50.25, 39.52, 50.10, 40.20, 8.46, 15.03, 25.84, 53.60, 30.40, 30.15]})
sales_df

        item     store  quantity  total_price
0   tomatoes  Downtown        15        50.25
1     onions  Downtown        26        39.52
2   potatoes   Midtown        10        50.10
3   tomatoes   Midtown        12        40.20
4  mushrooms  Downtown         2         8.46
5   potatoes   Midtown         3        15.03
6     onions  Downtown        17        25.84
7   tomatoes   Midtown        16        53.60
8     onions   Midtown        20        30.40
9   tomatoes   Midtown         9        30.15

In [6]:
item_group_df=sales_df.groupby("item")
item_group_df.mean()

           quantity  total_price
item
mushrooms       2.0        8.460
onions         21.0       31.920
potatoes        6.5       32.565
tomatoes       13.0       43.550

In [8]:
store_item_group_df=sales_df.groupby(["store", "item"])
store_item_group_df.max()

                    quantity  total_price
store    item
Downtown mushrooms         2         8.46
         onions           26        39.52
         tomatoes         15        50.25
Midtown  onions           20        30.40
         potatoes         10        50.10
         tomatoes         16        53.60